<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and add Malwarebytes Anti-Malware into Munki Repo</string>
    <key>Identifier</key>
    <string>com.github.darkomen78.munki.MalwarebytesAntiMalware</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Malwarebytes/</string>
        <key>NAME</key>
        <string>MalwarebytesAnti-Malware</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://data-cdn.mbamupdates.com/v1/mbam-mac/updates.xml</string>
        <key>APP_DESTINATION</key>
        <string>/Applications/</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Malwarebytes Anti-Malware is an application for Mac OS X designed to remove all known adware from your computer.
            It is very simple to use, and should clean up your system in less than a minute, from start to finish.</string>
            <key>display_name</key>
            <string>Malwarebytes Anti-Malware</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Utilities</string>
            <key>developer</key>
            <string>Thomas Reed</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>archive_format</key>
            <string>zip</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
          </dict>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
          </dict>
          <key>Processor</key>
          <string>DmgCreator</string>
        </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
            <key>additional_makepkginfo_options</key>
            <array>
              <string>--destinationpath</string>
              <string>%APP_DESTINATION%</string>
            </array>
          </dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
