<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Affinity 3.</string>
	<key>Identifier</key>
	<string>com.github.darkomen78.download.Affinity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Affinity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>  
    <key>Process</key>
    <array>
        <dict>
        	<key>Arguments</key>
            <dict>
				<key>url</key>
				<string>https://downloads.affinity.studio/Affinity.dmg</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
            <string>URLDownloader</string>
            </dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
        <key>Processor</key>
        <string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
            <key>dmg_path</key>
            <string>%pathname%</string>
        </dict>
    </dict>
	</array>
</dict>
</plist>
