<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Onyx for macOS 12, builds a pkg and installs it.</string>
	<key>Identifier</key>
	<string>com.github.darkomen78.install.Onyx12</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Onyx</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.darkomen78.pkg.Onyx12</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%*</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
