<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Re-packages, and imports Extensis Universal Type Client 7 into Munki repo.</string>
	<key>Identifier</key>
	<string>com.github.darkomen78.munki.UniversalTypeClient7</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Font Management</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>UniversalTypeClient7</string>
		<key>INSTALLCHECK_TEMPLATE</key>
		<string>UniversalTypeClient7.installcheck.template</string>
		<key>PKG_INSTALLCHECK</key>
		<string>UniversalTypeClient7.installcheck</string>
		<key>PKG_POSTINSTALL</key>
		<string>UniversalTypeClient7.postinstall</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Photoshop</string>
				<string>Adobe Illustrator</string>
				<string>Adobe InDesign</string>
				<string>Universal Type Client</string>
				<string>QuarkXPress</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Managing your fonts with Universal Type Server fuels your team’s creativity and productivity.

Store all of your fonts in a centralized, server-based font manager to ensure consistent, worry-free font usage across all of your projects.</string>
			<key>developer</key>
			<string>Extensis</string>
			<key>display_name</key>
			<string>Universal Type Client</string>
			<key>minimum_os_version</key>
			<string>10.11</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>i386</string>
				<string>x86_64</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.darkomen78.download.UniversalTypeClient7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/universalTypeClient.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Universal Type Client.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier &quot;com.extensis.UniversalTypeClient&quot; and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */) and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Universal Type Client.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Universal Type Client.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cs.extensis.com/fm_uninstall/utc/uninstall-utc.zip</string>
				<key>filename</key>
				<string>uninstall-utc.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/uninstall-utc.zip</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-removal-tool</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-removal-tool/*.command</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--uninstall_script=%found_filename%</string>
				</array>
				<key>_additional_makepkginfo_options</key>
				<array>
					<string>--installcheck_script=%RECIPE_CACHE_DIR%/%PKG_INSTALLCHECK%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
